from datetime import timedelta, datetime


subjects = ['Английский язык',  # 0
            'Биология',  # 1
            'География',  # 2
            'Информатика',  # 3
            'История',  # 4
            'Литература',  # 5
            'Математика',  # 6
            'Обществознание',  # 7
            'ОБЖ',  # 8
            'Русский язык',  # 9
            'Физика',  # 10
            'Физ-ра',  # 11
            'Химия',  # 12
            'Практикум по математике',  # 13
            'Астрономия',  # 14
            'Индивидуальный проект',  # 15
            'Практикум по обществознанию',  # 16
            'Обществознание 2',  # 17
            ]

weekdays = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница']

timetable = [[9, 0, 7, 10, 6, 5, 3],  # понедельник
             [1, 11, 0, 8, 6, 9, 5],  # вторник
             [6, 10, 12, 4, 0, 5, 14],  # среда
             [7, 6, 12, 9, 11, 17],  # четверг
             [15, 1, 0, 6, 13, 4, 16]]  # пятница

lesson_duration = timedelta(minutes=45)

lessons_start_time = ['8:30', '9:30', '10:30', '11:30', '12:30', '13:30', '14:30']
for time in lessons_start_time:
    lessons_start_time[lessons_start_time.index(time)] = datetime.strptime(time, '%H:%M')

emojis = ['0️⃣', '1️⃣', '2️⃣', '3️⃣', '4️⃣', '5️⃣', '6️⃣', '7️⃣']